{
  "mockEvents": [
    {
      "id": 1,
      "name": "FoodFest",
      "date": "2022-12-01",
      "pricePerTicket": 8,
      "eventDesc": "Come join us on our 44th year anniversary of FoodFest Toronto!. We have a notoriety of choices of food from different cultures around the globe. Its time for the celebration of foods from all around the world.Tickets starting at 8 dollars",
      "imageSrc": "foodfest.jpg"
    },
    {
      "id": 2,
      "name": "Fantasy Fair",
      "date": "2022-12-12",
      "pricePerTicket": 11,
      "eventDesc": "Fantasy Fair is Ontario’s Largest Indoor Amusement Park and has served over eight million guests since first opening in 1985. Fantasy Fair has 12 full-size rides and attractions. Fantasy Fair also offers birthday parties, educational fun and group visits year-round",
      "imageSrc": "fantasyfairr.jpg"
    },
    {
      "id": 3,
      "name": "Vegan for Beginners Workshop",
      "date": "2022-01-25",
      "pricePerTicket": 5,
      "eventDesc": "More and more people are interested in vegan/plant-based eating. Some are just curious, some want to get their feet wet, and some are ready to come to the V-side!Come Join us as we do a workshop in Vegan cooking",
      "imageSrc": "vegan.jpg"
    },
    {
      "id": 4,
      "name": "Introduction to Tai Chi",
      "date": "2022-03-25",
      "pricePerTicket": 8,
      "eventDesc": "This series does seasonal training to help you develop a wide range of skills which will enhance both your health and your practice. We practices basic Tai Chi skills as posting, walking, breathing, stretching, energy work, bone tapping and hand movements.",
      "imageSrc": "taichi.jpg"
    },
    {
      "id": 5,
      "name": "Health and Happiness",
      "date": "2022-11-22",
      "pricePerTicket": 5,
      "eventDesc": "The pandemic environment, personal problems and work pressure take a toll on our body and mind. The Art of Living brings you this free holistic and integrated workshop called the Health and Happiness which provide unique tools and techniques which help combat stress accumulated in our daily life",
      "imageSrc": "happiness.jpg"
    },
    {
      "id": 6,
      "name": "Art of Erasure",
      "date": "2022-06-10",
      "pricePerTicket": 7,
      "eventDesc": "A look at how rubbing out, drawing over, tearing, smudging, folding, screwing up, burning, poking holes through and nearly completely destroying your work is a well used method of many artists!",
      "imageSrc": "art.jpg"
    },
    {
      "id": 7,
      "name": "Tech Fair",
      "date": "2022-11-05",
      "pricePerTicket": 11,
      "eventDesc": "We will be hosting a Tech Career Fair with our hiring partners from fast growing startups and Fortune 500 companies in technology in the US/Canada.  There will be a focus on helping companies achieve their diversity and inclusivity initiative with more diverse candidates to their talent pool.",
      "imageSrc": "techfair.jpg"
    },
    {
      "id": 8,
      "name": "TED TALK X Toronto",
      "date": "11-11-25",
      "pricePerTicket": 15,
      "eventDesc": "TEDxToronto is coming back with a new lineup of talks that will inspire action, challenge the status quo, and drive change for the better.Join us for an event that will continue our mission of bringing fresh ideas from some of the boldest community leaders, innovators, and trailblazers in Toronto  and beyond.",
      "imageSrc": "tedtalk.jpg"
    },
    {
      "id": 9,
      "name": "Knee Pain Exercise Workshop",
      "date": "11-12-25",
      "pricePerTicket": 6,
      "eventDesc": "If you or a loved one is experiencing hip or knee pain, you won't want to miss this special event. This is an interactive workshop where you will perform the exercises while sitting at your computer.",
      "imageSrc": "kneepain.jpg"
    },
    {
      "id": 10,
      "name": "Santa Claus parade",
      "date": "12-20-2021",
      "pricePerTicket": 0,
      "eventDesc": "Since 1905, the Santa Claus Parade has kicked off the Christmas season, first in Toronto, then for the whole country as it has grown in popularity and importance throughout the years. The Parade brings people together, regardless of their background, celebrating hope, family and love. It’s part of the fabric of our community.",
      "imageSrc": "santaparade.jpg"
    },
    {
      "name": "Zak Birthday",
      "date": "2021-11-05",
      "pricePerTicket": "5",
      "eventDesc": "testing that data is stored",
      "imageSrc": "C:\\fakepath\\foodfest.jpg",
      "id": 11
    },
    {
      "name": "df",
      "date": "2021-11-30",
      "pricePerTicket": "7",
      "eventDesc": "dddddddddddd",
      "imageUrl": "C:\\fakepath\\art.jpg",
      "id": 12
    }
  ]
}